albert.TabOut
alefragnani.project-manager
alexkrechik.cucumberautocomplete
almenon.arepl
andyyaldoo.vscode-json
bierner.markdown-emoji
bierner.markdown-preview-github-styles
Dart-Code.dart-code
Dart-Code.flutter
DavidAnson.vscode-markdownlint
dbaeumer.vscode-eslint
eliazbobadilla.python-ultisnippets
felixrieseberg.vsc-travis-ci-status
formulahendry.code-runner
GitHub.github-vscode-theme
Gruntfuggly.todo-tree
helgardrichard.helium-icon-theme
humao.rest-client
IBM.output-colorizer
icrawl.discord-vscode
ivangabriele.vscode-heroku
jcbuisson.vue
jomeinaster.bracket-peek
KevinRose.vsc-python-indent
mechatroner.rainbow-csv
mrmlnc.vscode-duplicate
ms-azuretools.vscode-docker
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vsliveshare.vsliveshare
natqe.reload
nick-rudenko.back-n-forth
njpwerner.autodocstring
octref.vetur
oderwat.indent-rainbow
redhat.vscode-yaml
shailen.netlify
shardulm94.trailing-spaces
usernamehw.errorlens
VisualStudioExptTeam.vscodeintellicode
yzhang.markdown-all-in-one
