# setup taps
tap 'homebrew/autoupdate'
tap 'homebrew/core'
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'

################################
# fonts                        #
################################

brew 'font-fira-code'
brew 'font-inconsolata'

################################
# productivity                 #
################################

# powerful spotlight replacement
cask 'alfred' # ($)

# easily delete apps and their data
cask 'appcleaner'

# organize the menu bar
cask 'bartender' # ($)
  # cask 'dozer'
  # cask 'hiddenbar'

# app short cut cheatsheet
cask 'cheatsheet'

# prevent accidental quit apps
cask 'commandq' # ($)

# password and 2fa manager
# cask 'dashlane' ($)

# open source browser
cask 'firefox'

# adaptive brightness for external displays
# cask 'lunar' # ($)

# smart notepad calculator
cask 'numi' # ($)
  # cask 'soulver'

# window management
cask 'rectangle'

# emoji injector
cask 'rocket'

# todo list
cask 'todoist'

################################
# audio/video                  #
################################

# create elegant terminal screencaps
# brew 'asciinema'

# virtual audio driver
cask 'blackhole-16ch'

# system wide eq settings
# cask 'eqmac'

# elegant media player
# cask 'iina'

# create screencaps
cask 'kap'
  # cask 'gifox' # ($)

# TODO: add desc
# cask 'krisp'

# listen to music and podcasts
cask 'spotify'

# streaming software
cask 'streamlabs-obs'
  # brew 'elgato-game-capture-hd'

# watch streams
cask 'twitch'

################################
# developer tools              #
################################

# containerization
cask 'docker'

# develop flutter apps
cask 'flutter'

# github cli tool
brew 'gh'

# version control
brew 'git'

# git client
cask 'github'
  # cask 'gitkraken'

# heroku cli tool
tap 'heroku/brew'
brew 'heroku'

# rest client
cask 'insomnia'
  # cask 'postman'
  # cask 'paw' # ($)

# install and manage nodejs versions
brew 'nodenv'

# TODO: add desc
# brew 'pgcli'
brew 'postgresql'

# postgresql gui
cask 'postico'

# install and manage python versions
brew 'pyenv'

# create bootable raspberry pi drives
cask 'raspberry-pi-imager'

# travis ci cli tool
brew 'travis'

# text editor and IDE
cask 'visual-studio-code'
  # cask 'intellij-idea-ce'

################################
# design tools                 #
################################

# color picker
# cask 'pika'
  # cask 'sip' # ($)
  # cask 'couleurs'

# collaborative ui/ux design
# cask 'figma'

# open source vector graphics editor
# cask 'inkscape'

################################
# terminal/cli tools           #
################################

# brew 'autojump'
brew 'bat'

# cli rest client
brew 'httpie'

# hackable terminal replacement
cask 'hyper'
  # cask 'tabby'

# job scheduler
# tap 'liujianping/tap'
# brew 'job'

# macos swiss army knife cli tool
brew 'm-cli'

# unofficial mac app store cli tool
brew 'mas'

# simple and smart zsh prompt
brew 'spaceship'

# ssh client
# cask 'termius'

# simple community driven man pages
brew 'tldr'

# file retriever
brew 'wget'

# zsh tools
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

################################
# communication                #
################################

# gaming and collaboration chat
cask 'discord'

# development chat
# cask 'gitter'

# secure and private messaging
# cask 'signal'

################################
# gaming/emulation             #
################################

# gamecube and wii emulation
cask 'dolphin'

# minecraft java edition
cask 'minecraft'

# open source game emulator
# cask 'openemu'

################################
# utilities                    #
################################

# see inside mac apps
# cask 'apparency'

# homebrew gui
cask 'cakebrew'

# save websites to the dock as mac apps
# cask 'flotato'

# image compression
# cask 'imageoptim'

# file archiver and unarchiver
# cask 'keka'

# customize and control logitech peripherals
brew 'logitech-options'

# detect malware and other pests
# cask 'malwarebytes'

# finder util to open files/folders in vscode
# cask 'open-in-code'

# finder util to open files/folders in terminal
# cask 'openinterminal'

# quick look markdown plugin
cask 'qlmarkdown'

# quick look text file plugin
cask 'qlstephen'

# test internet speed cli tool
brew 'speedtest'

# display system stats in the menu bar
cask 'stats'

# check wifi password cli tool
brew 'wifi-password'

################################
# mac app store                #
# (only previously owned apps) #
################################

# ad blocker safari extension
# mas 'AdGuard for Safari', id: 1440147259

# markdown friendly notes app
# mas 'Bear', id: 1091189122

# password manager
# mas 'Dashlane', id: 517914548

# privacy safari extension
# mas 'DuckDuckGo Privacy Essentials', id: 1482920575

# email client
# mas 'Edison Mail', id: 1489591003

# white noise generator
# mas 'Noizio', id:

# spreadsheet
# mas 'Numbers', id: 409203825

# apple development ide
# mas 'Xcode', id: 497799835
