# tap fonts to install fira code typeface
tap 'homebrew/cask-fonts'
brew 'font-fira-code'

# install zsh tool formulae
brew 'spaceship'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# install cli tool formulae
brew 'bat'
brew 'gh'
brew 'git'
brew 'jq'
brew 'nodenv'
brew 'postgresql'
brew 'pyenv'
brew 'speedtest'
brew 'travis'
brew 'wget'
brew 'wifi-password'

# casks
cask 'alfred'
cask 'appcleaner'
cask 'bartender'
cask 'blackhole-16ch'
cask 'discord'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'flutter'
cask 'gifox'
cask 'github'
cask 'hyper'
cask 'insomnia'
cask 'intellij-idea-ce'
cask 'numi'
cask 'postico'
cask 'postman'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'raspberry-pi-imager'
cask 'spotify'
cask 'streamlabs-obs'
cask 'twitch'
cask 'visual-studio-code'
